simulations/lift-drag/converge/N3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          90;
        startFace       64110;
    }
    outlet
    {
        type            patch;
        nFaces          90;
        startFace       64200;
    }
    airfoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          480;
        startFace       64290;
    }
    top_fore
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       64770;
    }
    top_wake
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          60;
        startFace       65070;
    }
    bottom_fore
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       65130;
    }
    bottom_wake
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          60;
        startFace       65430;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          64800;
        startFace       65490;
    }
)

// ************************************************************************* //
